Тест_ЗУП_31_КОРП/src/Enums/ТемыОформленияЭлектронныхКурсов/ТемыОформленияЭлектронныхКурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТемыОформленияЭлектронныхКурсов</name>
  <enumValues>
    <name>Облако</name>
  </enumValues>
  <enumValues>
    <name>Пляж</name>
  </enumValues>
  <enumValues>
    <name>Аквамарин</name>
  </enumValues>
  <enumValues>
    <name>Лето</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/ТемыОформленияЭлектронныхКурсов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
	
Функция КодТемы(Тема) Экспорт
	
	Если Тема = Перечисления.ТемыОформленияЭлектронныхКурсов.Облако Тогда
		Возврат "cloud";
	КонецЕсли;
	
	Если Тема = Перечисления.ТемыОформленияЭлектронныхКурсов.Пляж Тогда
		Возврат "beach";
	КонецЕсли;
	
	Если Тема = Перечисления.ТемыОформленияЭлектронныхКурсов.Аквамарин Тогда
		Возврат "aquamarine";
	КонецЕсли;
	
	Если Тема = Перечисления.ТемыОформленияЭлектронныхКурсов.Лето Тогда
		Возврат "summer";
	КонецЕсли;	
	
	Возврат "cloud";
	
КонецФункции

#КонецОбласти

#КонецЕсли
